{
    "intents": [
        {
            "tag": "saludo",
            "patterns": ["hola", "qué tal", "cómo estás", "saludos"],
            "responses": ["Hola!", "Buenos días!", "¿Cómo estás?"]
        },
        {
            "tag": "nombre",
            "patterns": ["cómo es tu nombre", "cómo te llamas"],
            "responses": ["Soy The Fit Lab, ¿en que puedo ayudarte?"]
        },
        {
            "tag": "entrenamiento",
            "patterns": ["cuál es la mejor rutina de entrenamiento", "ejercicios para tonificar", "cómo empezar a entrenar"],
            "responses": ["La mejor rutina de entrenamiento depende de tus objetivos. ¿Quieres ganar fuerza, perder peso o tonificar?",
                           "Para tonificar, te recomendaría una combinación de entrenamiento de fuerza y cardio. ¿Cuántos días a la semana puedes dedicar al ejercicio?"]
        },
        {
            "tag": "objetivos",
            "patterns": ["cómo perder peso", "cómo ganar músculo", "cómo mejorar mi resistencia"],
            "responses": ["Perder peso generalmente implica una combinación de ejercicio y una dieta equilibrada. ¿Te gustaría ayuda con un plan específico?",
                           "Ganar músculo requiere entrenamiento de fuerza y una ingesta adecuada de proteínas. ¿Cuántas veces a la semana puedes hacer entrenamiento de fuerza?",
                           "Para mejorar la resistencia, es importante incorporar entrenamientos cardiovasculares. ¿Cuál es tu nivel actual de resistencia?"]
        },
        {
            "tag": "dieta",
            "patterns": ["qué debo comer para perder peso", "cuál es una dieta balanceada", "snacks saludables"],
            "responses": ["Una dieta equilibrada incluye proteínas magras, verduras, frutas y granos enteros. ¿Cuántas comidas haces al día?",
                           "Para perder peso, es importante controlar las porciones y elegir alimentos nutritivos. ¿Tienes alguna preferencia dietética?",
                           "Los snacks saludables pueden ser frutas, yogur griego o frutos secos. ¿Tienes alguna preferencia en particular?"]
        },
        {
            "tag": "descanso",
            "patterns": ["cuánto descanso necesito", "es importante descansar", "cómo mejorar mi sueño"],
            "responses": ["El descanso es crucial para la recuperación muscular. ¿Cuántas horas duermes cada noche?",
                           "Descansar adecuadamente permite que tu cuerpo se recupere y evita el sobreentrenamiento. ¿Sientes que estás descansando lo suficiente?",
                           "Mejorar la calidad del sueño incluye establecer una rutina regular de sueño y evitar dispositivos electrónicos antes de dormir. ¿Sigues alguna rutina actualmente?"]
        },
        {
            "tag": "motivacion",
            "patterns": ["cómo mantener la motivación", "superar la pereza", "cómo establecer metas realistas"],
            "responses": ["Mantener la motivación puede ser desafiante, pero establecer metas realistas y celebrar los logros pequeños puede ayudar. ¿Tienes metas específicas en mente?",
                           "Superar la pereza a veces requiere cambiar la perspectiva y recordar por qué empezaste. ¿Cuál es tu mayor motivación para entrenar?",
                           "Establecer metas realistas y a corto plazo puede hacer que el proceso sea más manejable. ¿Necesitas ayuda para definir metas alcanzables?"]
        },
        {
            "tag": "nutricion",
            "patterns": ["cuál es la importancia de la nutrición", "cómo planificar comidas", "suplementos recomendados"],
            "responses": ["La nutrición es clave para alcanzar tus objetivos. ¿Necesitas ayuda para planificar tus comidas de manera equilibrada?",
                           "Planificar comidas incluye equilibrar proteínas, carbohidratos y grasas. ¿Tienes alguna preferencia alimentaria o restricciones?",
                           "Los suplementos pueden ser útiles según tus necesidades. ¿Hay algo en particular sobre lo que te gustaría obtener información?"]
        },
        {
            "tag": "lesiones",
            "patterns": ["cómo prevenir lesiones", "qué hacer en caso de lesiones", "ejercicios seguros"],
            "responses": ["Para prevenir lesiones, es importante calentar antes del ejercicio y seguir una buena técnica. ¿Realizas un calentamiento adecuado?",
                           "En caso de lesiones, es crucial consultar a un profesional de la salud. ¿Has experimentado alguna lesión recientemente?",
                           "Hay ejercicios seguros para cada persona. ¿Hay alguna actividad en particular que te preocupe?"]
        },
        {
            "tag": "rutina_personalizada",
            "patterns": ["puedes crear una rutina personalizada", "necesito un plan de entrenamiento", "personalizar mi dieta"],
            "responses": ["¡Por supuesto! Para una rutina personalizada, necesitaría conocer más sobre tus objetivos, nivel de condición física y preferencias. ¿Puedes proporcionar más detalles?",
                           "Crear una rutina personalizada implica adaptar el entrenamiento y la dieta a tus necesidades específicas. ¿Tienes alguna preferencia en cuanto a la duración de las sesiones de entrenamiento o tipo de alimentos?",
                           "Personalizar tu dieta y entrenamiento puede marcar la diferencia. Cuéntame más sobre tus metas y limitaciones, y te ayudaré a diseñar un plan adecuado."]
        },
        {
            "tag": "avances",
            "patterns": ["cómo medir mis avances", "registros de entrenamiento", "cambios en el cuerpo"],
            "responses": ["Medir tus avances puede incluir llevar un registro de tus entrenamientos, tomar medidas corporales o incluso fotos. ¿Sigues algún método actualmente?",
                           "Llevar un registro de tus entrenamientos y cambios en el cuerpo te ayuda a evaluar tus avances. ¿Tienes alguna pregunta específica sobre seguimiento?",
                           "Los cambios en el cuerpo pueden llevar tiempo. Es importante ser consistente y celebrar los logros a lo largo del camino. ¿Necesitas orientación sobre cómo medir tus avances?"]
        },
        {
            "tag": "agradecimiento",
            "patterns": ["gracias por tu ayuda", "agradecido por los consejos", "eres de gran ayuda"],
            "responses": ["¡De nada! Estoy aquí para ayudarte en tu viaje fitness. Si tienes más preguntas, no dudes en preguntar.",
                           "¡Gracias por tus palabras! Estoy feliz de poder ser parte de tu camino hacia una vida más saludable."]
        },
        {
            "tag": "despedida",
            "patterns": ["adiós", "hasta luego", "nos vemos"],
            "responses": ["¡Hasta luego!", "Si necesitas más ayuda, estaré aquí. ¡Nos vemos pronto!"]
        }
    ]
}
